Tekla Open API Reference for Tekla Structures 2025
StructuresDialogAttribute Constructor (String)
 Initializes a new StructuresDialogAttribute instance.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public StructuresDialogAttribute(
	string attributeName
)
Public Sub New (
	attributeName As String
)
Parameters
attributeName
Type: System.String
The attribute name of the property.
See Also
Reference
StructuresDialogAttribute Class
StructuresDialogAttribute Overload
Tekla.Structures.Dialog Namespace